---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.GetSchedulableFields
source: html/66f9648b-dd64-6ff5-ef89-4f1d6b5c4a23.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.GetSchedulableFields Method

Gets a list of all non-calculated/non-combined fields that are eligible to be
 included in this schedule.

## Syntax (C#)
```csharp
public IList<SchedulableField> GetSchedulableFields()
```

## Returns
A list of SchedulableField objects representing the non-calculated/non-combined
 fields that may be included in the schedule.